justintormey/wifi-csi/firmware/sdkconfig.defaults
# WiFi CSI Firmware — Default SDK Configuration
# Target: ESP32-S3 with HT40, WiFi STA, MQTT, CSI enabled

# ── Target ──
CONFIG_IDF_TARGET="esp32s3"

# ── WiFi ──
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_CSI_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# HT40 mode for 114 subcarriers (vs 52 for HT20)
CONFIG_ESP_WIFI_11N_SUPPORT=y

# ── Networking ──
CONFIG_LWIP_IP4_FRAG=y
CONFIG_LWIP_IP4_REASSEMBLY=y

# ── MQTT ──
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_CUSTOM_OUTBOX=n

# ── System ──
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── Flash / PSRAM ──
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ── Logging ──
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Board role (override per board at flash time) ──
CONFIG_CSI_BOARD_ROLE_RX=y

# ── WiFi credentials (override per deployment) ──
CONFIG_CSI_WIFI_SSID="MyHomeWiFi"
CONFIG_CSI_WIFI_PASSWORD="changeme"
CONFIG_CSI_WIFI_CHANNEL=1
CONFIG_CSI_FLOOR_ID=0
CONFIG_CSI_MQTT_BROKER_IP="192.168.1.100"
CONFIG_CSI_MQTT_BROKER_PORT=1883
CONFIG_CSI_TX_RATE_HZ=100
CONFIG_CSI_BOARD_ID="board-01"
CONFIG_CSI_TX_TARGET_IP="255.255.255.255"
CONFIG_CSI_TX_UDP_PORT=5500
